{

    "cryptoclass": { 
        "type": "paper",
        "title": "Deep Learning Based Cryptographic Primitive Classification", 
        "link": "https://arxiv.org/abs/1709.08385",
        "description": "My honours research constructed and implemented an advanced methodology for identifying cryptographic algorithms in compiled binary samples using machine learning. Features were built using dynamic binary instrumentation, then fed through a unique Dynamic Convolutional Neural Network (DCNN). The results are currently in pre-print, but my work was awarded the <a href='https://www.abertay.ac.uk/news/2017/prizewinners-honoured-for-stellar-achievements'>Honorary Fellows Prize for Innovation</a> by Abertay University in 2017."
    },

    "webpenbook": {
        "type": "book",
        "title": "Kali Linux Web Penetration Testing Cookbook", 
        "link": "https://books.google.co.uk/books?id=iGRLDAAAQBAJ&pg=PP6&lpg=PP6&dq=Greg+Hill&source=bl&ots=pNp9rSoYN3&sig=RlthaecEN2cdvhPcESQsRvz3Y5c&hl=en&sa=X&ved=0ahUKEwikg8yknozWAhUhLMAKHUlJDHEQ6AEIOjAF#v=onepage&q=Greg%20Hill&f=false",
        "description": "I was approached to review the 'Kali Linux Web Penetration Testing Cookbook' by Packt Publishing in 2015. After thoroughly testing all content and investigating improvements, I was acknowledged as a reviewer when it was published in early 2016." 
    },

    "rivest-study": { 
        "type": "paper",
        "title": "The Modern Relationship Between Cryptography And Machine Learning", 
        "link": "docs/irr.pdf",
        "description": "This literature review was composed as part of a module at the <a href='http://www.inf.ed.ac.uk/teaching/courses/irr/'>University of Edinburgh</a>. Based on an older study by <a href='http://people.csail.mit.edu/rivest/pubs/Riv91.pdf'>Rivest</a>, the aim was to survey contemporary research areas linked to the intersection between these two fundamental areas of study."
    },

    "mlpgroup": { 
        "type": "paper",
        "title": "Image Forgery Detection",
        "link": "docs/mlp.pdf",
        "description": "Despite efforts to detect fictitious content, it is more prevalent than ever. Deep neural networks give practitioners the ability to realistically alter the content in digital media with veritable ease, but can these systems be used to combat illicit material? As part of a group project for <a href='https://www.inf.ed.ac.uk/teaching/courses/mlp/'>Machine Learning Practical (MLP)</a>, we implemented a proof-of-concept classification tool to discriminate between real and fake images."
    },

    "idsevasion": { 
        "type": "paper",
        "title": "Intrusion Detection System (IDS) Evasion", 
        "link": "docs/idsevasion.pdf",
        "description": "As part of a third year module at Abertay University I evaluated common packages that aim to combat network incursion and detect advanced persistent threats. By comparing their ability to prevent several evasion techniques, the results concluded that these setups occasionally faltered due to outdated rulesets."
    },

    "xssfuzzing": { 
        "type": "paper",
        "title": "Cross-Site Scripting (XSS) Fuzzing",
        "link": "docs/xssfuzzing.pdf",
        "description": "The attack surface of a typical web application is often quite large, hence it can prove challenging for a security professional to locate and exploit certain vulnerabilities. I studied five different automated XSS tools to illustrate advanced tactics for web exploitation that simplified vulnerability location. The latter stage of the report proposed countermeasures based on the <a href='https://www.owasp.org/'>OWASP</a> guidelines."
    },

    "ddosattacks": { 
        "type": "paper",
        "title": "Denial of Service (DoS) Attack Methodologies", 
        "link": "docs/ddos.pdf",
        "description": "This paper outlined volume based, protocol and application layer attacks utilised by infamous hacktivists. Through the implementation of these techniques, the aim of the project was to aid in the design of more resilient systems. The project was presented at SecuriTay 5 and <a href='https://berlinsides.org/?page_id=1911'>BerlinSides</a> in 2016."
    },


    "exploitexp": { 
        "type": "paper",
        "title": "Exploit Development", 
        "link": "docs/exploit.pdf",
        "description": "Each student was randomly assigned a vulnerable media application to track inherent security flaws and construct a custom payload. It was shown in this report that GSPlayer suffered from a buffer overflow vulnerability that was exploitable in environments with and without Data Execution Prevention (DEP)."
    }

}
